{
  "_status": "PRE_TRAINING_PLACEHOLDER",
  "_note": "This directory will contain the real PEFT LoRA adapter weights after running scripts/train_judge_lora.py in Google Colab T4. The 3-field stub that was here previously was generated by run_training_stub.py (now deleted) and contained no real model weights.",
  "_training_required": {
    "script": "scripts/train_judge_lora.py",
    "compute": "Google Colab T4 GPU (16 GB VRAM) or RunPod community 4090",
    "estimated_time": "45-90 minutes",
    "preflight": "scripts/colab_preflight.py"
  },
  "intended_config": {
    "peft_type": "LORA",
    "task_type": "SEQ_CLS",
    "r": 16,
    "lora_alpha": 32,
    "lora_dropout": 0.0,
    "bias": "none",
    "target_modules": ["q_proj", "k_proj", "v_proj", "o_proj", "gate_proj", "up_proj", "down_proj"],
    "base_model_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
    "inference_mode": true,
    "use_dora": false,
    "use_rslora": false
  }
}
